In [15]:
import duckdb

In [16]:
con = duckdb.connect(database='dados_duckdb.db', read_only=False)

In [17]:
df = con.execute("SELECT * FROM produtos").fetchdf()
df.head(10)

     id nm_produto id_categoria  id_fornecedor  vl_preco
0  1002    MARTELO         BT50            100    1500.0
1  1001   PARAFUSO         BT10            100     100.0
2  1003      PREGO         BT10            100      60.0
3  1004      SERRA         BT10            100     200.0
4  1005    MACHADO         BT10            100     100.0

In [18]:
df2 = df.drop(columns=['id_fornecedor', 'id_categoria'])

df2.head(10)

     id nm_produto  vl_preco
0  1002    MARTELO    1500.0
1  1001   PARAFUSO     100.0
2  1003      PREGO      60.0
3  1004      SERRA     200.0
4  1005    MACHADO     100.0

In [26]:
con.execute("""
               CREATE TABLE IF NOT EXISTS dim_produtos (
                   id_produto BIGINT,
                   nm_produto TEXT,
                   vl_produto FLOAT
               )
               """)

In [27]:
con.execute("INSERT INTO dim_produtos SELECT * FROM df2")

In [28]:
df_dim = con.execute("SELECT * FROM dim_produtos").fetchdf()
df_dim.head(10)

   id_produto nm_produto  vl_produto
0        1002    MARTELO      1500.0
1        1001   PARAFUSO       100.0
2        1003      PREGO        60.0
3        1004      SERRA       200.0
4        1005    MACHADO       100.0